stephenjust/PIC_MultiTouch/MultiTouch_Screen.X/Common/p18f14k50.h
extern volatile near unsigned char       CM1CON0;
extern volatile near union {
  struct {
    unsigned C1CH:2;
    unsigned C1R:1;
    unsigned C1SP:1;
    unsigned C1POL:1;
    unsigned C1OE:1;
    unsigned C1OUT:1;
    unsigned C1ON:1;
  };
  struct {
    unsigned C1CH0:1;
    unsigned C1CH1:1;
  };
} CM1CON0bits;
extern volatile near unsigned char       SSPMSK;
extern volatile near union {
  struct {
    unsigned MSK:8;
  };
  struct {
    unsigned MSK0:1;
    unsigned MSK1:1;
    unsigned MSK2:1;
    unsigned MSK3:1;
    unsigned MSK4:1;
    unsigned MSK5:1;
    unsigned MSK6:1;
    unsigned MSK7:1;
  };
} SSPMSKbits;
extern volatile near unsigned char       SLRCON;
extern volatile near struct {
  unsigned SLRA:1;
  unsigned SLRB:1;
  unsigned SLRC:1;
} SLRCONbits;
extern volatile near unsigned char       WPUA;
extern volatile near struct {
  unsigned :3;
  unsigned WPUA3:1;
  unsigned WPUA4:1;
  unsigned WPUA5:1;
} WPUAbits;
extern volatile near unsigned char       WPUB;
extern volatile near struct {
  unsigned :4;
  unsigned WPUB4:1;
  unsigned WPUB5:1;
  unsigned WPUB6:1;
  unsigned WPUB7:1;
} WPUBbits;
extern volatile near unsigned char       IOCA;
extern volatile near struct {
  unsigned IOCA0:1;
  unsigned IOCA1:1;
  unsigned :1;
  unsigned IOCA3:1;
  unsigned IOCA4:1;
  unsigned IOCA5:1;
} IOCAbits;
extern volatile near unsigned char       IOCB;
extern volatile near struct {
  unsigned :4;
  unsigned IOCB4:1;
  unsigned IOCB5:1;
  unsigned IOCB6:1;
  unsigned IOCB7:1;
} IOCBbits;
extern volatile near unsigned char       ANSEL;
extern volatile near struct {
  unsigned :3;
  unsigned ANS3:1;
  unsigned ANS4:1;
  unsigned ANS5:1;
  unsigned ANS6:1;
  unsigned ANS7:1;
} ANSELbits;
extern volatile near unsigned char       ANSELH;
extern volatile near struct {
  unsigned ANS8:1;
  unsigned ANS9:1;
  unsigned ANS10:1;
  unsigned ANS11:1;
} ANSELHbits;
extern volatile near unsigned char       PORTA;
extern volatile near union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned :1;
    unsigned RA3:1;
    unsigned RA4:1;
    unsigned RA5:1;
  };
  struct {
    unsigned :4;
    unsigned AN3:1;
  };
  struct {
    unsigned :4;
    unsigned OSC2:1;
    unsigned OSC1:1;
  };
  struct {
    unsigned :4;
    unsigned CLKOUT:1;
    unsigned CLKIN:1;
  };
} PORTAbits;
extern volatile near unsigned char       PORTB;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
  };
  struct {
    unsigned :4;
    unsigned SDI:1;
    unsigned RX:1;
    unsigned SCL:1;
    unsigned TX:1;
  };
  struct {
    unsigned :4;
    unsigned SDA:1;
    unsigned DT:1;
    unsigned SCK:1;
    unsigned CK:1;
  };
  struct {
    unsigned :4;
    unsigned AN10:1;
    unsigned AN11:1;
  };
} PORTBbits;
extern volatile near unsigned char       PORTC;
extern volatile near union {
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned RC5:1;
    unsigned RC6:1;
    unsigned RC7:1;
  };
  struct {
    unsigned AN4:1;
    unsigned AN5:1;
    unsigned AN6:1;
    unsigned AN7:1;
    unsigned :2;
    unsigned AN8:1;
    unsigned AN9:1;
  };
  struct {
    unsigned C12INP:1;
    unsigned C12IN1M:1;
    unsigned C12IN2M:1;
    unsigned C12IN3M:1;
    unsigned C12OUT:1;
    unsigned CCP1:1;
    unsigned NOT_SS:1;
  };
  struct {
    unsigned INT0:1;
    unsigned INT1:1;
    unsigned INT2:1;
    unsigned PGM:1;
    unsigned SRQ:1;
    unsigned T0CKI:1;
    unsigned T13CKI:1;
    unsigned T1OSCO:1;
  };
  struct {
    unsigned VREFP:1;
    unsigned VREFM:1;
    unsigned CVREF:1;
    unsigned :3;
    unsigned T1OSCI:1;
  };
  struct {
    unsigned :2;
    unsigned P1D:1;
    unsigned P1C:1;
    unsigned P1B:1;
    unsigned P1A:1;
    unsigned SS:1;
    unsigned SDO:1;
  };
} PORTCbits;
extern volatile near unsigned char       LATA;
extern volatile near struct {
  unsigned :4;
  unsigned LATA4:1;
  unsigned LATA5:1;
} LATAbits;
extern volatile near unsigned char       LATB;
extern volatile near struct {
  unsigned :4;
  unsigned LATB4:1;
  unsigned LATB5:1;
  unsigned LATB6:1;
  unsigned LATB7:1;
} LATBbits;
extern volatile near unsigned char       LATC;
extern volatile near struct {
  unsigned LATC0:1;
  unsigned LATC1:1;
  unsigned LATC2:1;
  unsigned LATC3:1;
  unsigned LATC4:1;
  unsigned LATC5:1;
  unsigned LATC6:1;
  unsigned LATC7:1;
} LATCbits;
extern volatile near unsigned char       DDRA;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned TRISA4:1;
    unsigned TRISA5:1;
  };
  struct {
    unsigned :4;
    unsigned RA4:1;
    unsigned RA5:1;
  };
} DDRAbits;
extern volatile near unsigned char       TRISA;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned TRISA4:1;
    unsigned TRISA5:1;
  };
  struct {
    unsigned :4;
    unsigned RA4:1;
    unsigned RA5:1;
  };
} TRISAbits;
extern volatile near unsigned char       DDRB;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned TRISB4:1;
    unsigned TRISB5:1;
    unsigned TRISB6:1;
    unsigned TRISB7:1;
  };
  struct {
    unsigned :4;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
  };
} DDRBbits;
extern volatile near unsigned char       TRISB;
extern volatile near union {
  struct {
    unsigned :4;
    unsigned TRISB4:1;
    unsigned TRISB5:1;
    unsigned TRISB6:1;
    unsigned TRISB7:1;
  };
  struct {
    unsigned :4;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
  };
} TRISBbits;
extern volatile near unsigned char       DDRC;
extern volatile near union {
  struct {
    unsigned TRISC0:1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned TRISC4:1;
    unsigned TRISC5:1;
    unsigned TRISC6:1;
    unsigned TRISC7:1;
  };
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned RC5:1;
    unsigned RC6:1;
    unsigned RC7:1;
  };
} DDRCbits;
extern volatile near unsigned char       TRISC;
extern volatile near union {
  struct {
    unsigned TRISC0:1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned TRISC4:1;
    unsigned TRISC5:1;
    unsigned TRISC6:1;
    unsigned TRISC7:1;
  };
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned RC5:1;
    unsigned RC6:1;
    unsigned RC7:1;
  };
} TRISCbits;
